Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: To automatically scale or tile the image, pass one of these ``align`` values:
it_it: Per ridimensionare o affiancare automaticamente l'immagine, passare uno di questi valori di ``align``:

source: To avoid making the entire Test module dependent on ``lodepng``, screenshot comparison can be individually enabled by ``LV_USE_TEST_SCREENSHOT_COMPARE``.
it_it: Per evitare di rendere l'intero modulo Test dipendente da ``lodepng``, il confronto degli screenshot può essere abilitato singolarmente tramite ``LV_USE_TEST_SCREENSHOT_COMPARE``.

source: To avoid this contradiction, add :cpp:expr:`lv_buttonmatrix_set_button_ctrl_all(btn_matrix, LV_BUTTONMATRIX_CTRL_CLICK_TRIG | LV_BUTTONMATRIX_CTRL_NO_REPEAT)` to the Button Matrix if used with an encoder.
it_it: Per evitare questa contraddizione, aggiungere :cpp:expr:`lv_buttonmatrix_set_button_ctrl_all(btn_matrix, LV_BUTTONMATRIX_CTRL_CLICK_TRIG | LV_BUTTONMATRIX_CTRL_NO_REPEAT)` alla Button Matrix se utilizzata con un encoder.

source: To build Samsung's Rlottie, you will need a C++14-compatible compiler and optionally CMake 3.14 or higher.
it_it: Per compilare Rlottie di Samsung, è necessario un compilatore compatibile con C++14 e, facoltativamente, CMake 3.14 o superiore.

source: To build a Torizon container for ARM on your development machine, you need to enable Docker emulation.
it_it: Per creare un container Torizon per ARM sulla propria macchina di sviluppo, si deve abilitare l'emulazione Docker.

source: To build all libraries, simply invoke `make` in this directory:
it_it: Per compilare tutte le librerie, è sufficiente richiamare `make` in questa directory:

source: To build an image for Raspberrypi3 64 bits, modify the file ``local.conf`` file replacing the ``MACHINE ??=`` default value like this
it_it: Per compilare un'immagine per RaspberryPi3 64 bit, modificare il file ``local.conf`` sostituendo il valore di default ``MACHINE ??=`` in questo modo

source: To build on a desktop you can follow the instructions from Rlottie's `README <https://github.com/Samsung/rlottie/blob/master/README.md>`__.
it_it: Per compilare su un desktop, si possono seguire le istruzioni del file `README <https://github.com/Samsung/rlottie/blob/master/README.md>`__.

source: To build the documentation on Windows:
it_it: Per compilare la documentazione su Windows:

source: To build the image we will target, it is also needed to add this to the file:
it_it: Per compilare l'immagine da utilizzare, è necessario aggiungere anche quanto segue al file:

source: To change the properties of widgets, two sets of functions can be used:
it_it: Per modificare le proprietà dei widget, è possibile utilizzare due set di funzioni:

source: To change this behavior to shifting to the left, the :cpp:expr:`lv_spinbox_set_digit_step_direction(spinbox, LV_DIR_LEFT)` can be used.
it_it: Per modificare questo comportamento e spostarla a sinistra, è possibile utilizzare :cpp:expr:`lv_spinbox_set_digit_step_direction(spinbox, LV_DIR_LEFT)`.

source: To check if a Widget is in a given state use :cpp:expr:`lv_obj_has_state(widget, LV_STATE_...)`.
it_it: Per verificare se un Widget si trova in un determinato stato, utilizzare :cpp:expr:`lv_obj_has_state(widget, LV_STATE_...)`.

source: To check if a flag is set, use: :cpp:expr:`lv_obj_has_flag(obj, LV_OBJ_FLAG_...)`.
it_it: Per verificare se un flag è impostato, utilizzare: :cpp:expr:`lv_obj_has_flag(obj, LV_OBJ_FLAG_...)`.

source: To clarify what ``my_ltdc_framebuffer_address`` exactly is, it's the value of ``pLayerCfg.FBStartAdress`` when the LTDC layer is configured using the STM32 HAL, which is written to the ``CFBAR`` register of the LTDC layer peripheral.
it_it: Per chiarire cosa sia esattamente ``my_ltdc_framebuffer_address``, si tratta del valore di ``pLayerCfg.FBStartAdress`` quando il layer LTDC viene configurato utilizzando l'HAL STM32, che viene scritto nel registro ``CFBAR`` della periferica del layer LTDC.

source: To configure LVGL, launch the configuration menu with ``idf.py menuconfig`` in your project root directory.
it_it: Per configurare LVGL, avviare il menù di configurazione con ``idf.py menuconfig`` nella directory principale del progetto.

source: To configure kerning at runtime, use :cpp:func:`lv_font_set_kerning`.
it_it: Per configurare il kerning in fase di esecuzione, si usa :cpp:func:`lv_font_set_kerning`.

source: To connect this data to the XML world, LVGL provides many ``lv_xml_register_...()`` functions to register:
it_it: Per collegare questi dati al mondo XML, LVGL fornisce numerose funzioni ``lv_xml_register_...()`` per registrare:

source: To create a "bar" cursor leave the cursor transparent and set a left border.
it_it: Per creare un cursore a "barra", lasciare il cursore trasparente e impostare un bordo sinistro.

source: To create a LVGL application for QNX, follow these steps in your code:
it_it: Per creare un'applicazione LVGL per QNX, seguire questi passaggi nel codice:

source: To create a Lottie animation from a file, use:
it_it: Per creare un'animazione Lottie da un file, si usa:

source: To create a display for LVGL:
it_it: Per creare un display per LVGL:

source: To create a font for LVGL:
it_it: Per creare un font per LVGL:

source: To create a group, use :cpp:expr:`lv_group_t * g = lv_group_create()`, and to add a widget to the group, use :cpp:expr:`lv_group_add_obj(g, widget)`.
it_it: Per creare un gruppo, si usa :cpp:expr:`lv_group_t * g = lv_group_create()`, e per aggiungere un widget al gruppo, si usa :cpp:expr:`lv_group_add_obj(g, widget)`.

source: To create a link to 1 or more API pages, set up a section at the end of your .rst file that looks like this, and use one or both types of the ..
it_it: Per creare un link a una o più pagine API, impostare una sezione alla fine del proprio file .rst simile a questa e utilizzare uno o entrambi i tipi di pseudo-direttive ..

source: To create a new *imgfont*:
it_it: Per creare un nuovo *imgfont*:

source: To create a new Timer, use :cpp:expr:`lv_timer_create(timer_cb, period_ms, user_data)`.
it_it: Per creare un nuovo Timer, si usa :cpp:expr:`lv_timer_create(timer_cb, period_ms, user_data)`.

source: To create a new layer, use :cpp:func:`lv_draw_layer_create`:
it_it: Per creare un nuovo layer, si usa :cpp:func:`lv_draw_layer_create`:

source: To create a special subject which formats an integer temperature value as a string with a decimal point:
it_it: Per creare un oggetto speciale che formatti un valore di temperatura intero come stringa con un punto decimale:

source: To create a spinner use :cpp:expr:`lv_spinner_create(parent)`.
it_it: Per creare uno Spinner, si usa :cpp:expr:`lv_spinner_create(parent)`.

source: To create an Animation, start by creating an Animation *template* in an :cpp:type:`lv_anim_t` variable.
it_it: Per creare un'Animazione, si inizia creando un *template* di Animazione in una variabile :cpp:type:`lv_anim_t`.

source: To create an ILI9341-based display use the function
it_it: Per creare un display basato su ILI9341, utilizzare la funzione

source: To create an NV3007-based display use the function
it_it: Per creare un display basato su NV3007, si usa la funzione

source: To create an ST7735-based display use the function
it_it: Per creare un display basato su ST7735 utilizzare la funzione

source: To create an ST7789-based display use the function
it_it: Per creare un display basato su ST7789 utilizzare la funzione

source: To create an ST7796-based display use the function
it_it: Per creare un display basato su ST7796 utilizzare la funzione

source: To create an animation from data use :cpp:expr:`lv_lottie_set_src_data(lottie, data, sizeof(data))`
it_it: Per creare un'animazione dai dati, si usa :cpp:expr:`lv_lottie_set_src_data(lottie, data, sizeof(data))`

source: To create an animation from raw data:
it_it: Per creare un'animazione da dati grezzi:

source: To create an input device, only two things are required:
it_it: Per creare un dispositivo di input, sono necessarie solo due cose:

source: To create and use an Animation Timeline:
it_it: Per creare e utilizzare una Timeline di Animazione:

source: To create the LVGL display for the EVE renderer, you call :cpp:expr:`lv_draw_eve_display_create(params, op_cb, your_user_data)` which returns the created display.
it_it: Per creare il display LVGL per il renderer EVE, si chiama :cpp:expr:`lv_draw_eve_display_create(params, op_cb, your_user_data)` che restituisce il display creato.

source: To decide which image to close, LVGL uses an LRU (least-recently-used) algorithm.
it_it: Per decidere quale immagine chiudere, LVGL utilizza un algoritmo LRU (least-recently-used).

source: To declare a font in a file, use :cpp:expr:`LV_FONT_DECLARE(my_font_name)`.
it_it: Per dichiarare un font in un file, si usa :cpp:expr:`LV_FONT_DECLARE(my_font_name)`.

source: To decode and display a GIF animation ~25 kB of RAM is needed plus (color format pixel size + 1) |times| image width |times| image height.
it_it: Per decodificare e visualizzare un'animazione GIF sono necessari circa 25 kB di RAM più (dimensione pixel del formato colore + 1) |times| larghezza immagine |times| altezza immagine.

source: To define a conical gradient:
it_it: Per definire un gradiente conico:

source: To define a radial gradient:
it_it: Per definire un gradiente radiale:

source: To define a simple ``<horizontal>`` or ``<vertical>`` gradient:
it_it: Per definire un semplice gradiente ``<horizontal>`` o ``<vertical>``:

source: To define a skewed gradient from two points:
it_it: Per definire un gradiente inclinato da due punti:

source: To define the type of the ``<view>``, use the ``extends`` attribute.
it_it: Per definire il tipo di ``<view>``, si usa l'attributo ``extends``.

source: To delete a font, use :cpp:func:`lv_freetype_font_delete`.
it_it: Per eliminare un font, si usa :cpp:func:`lv_freetype_font_delete`.

source: To delete it, call :cpp:expr:`lv_monkey_delete(monkey)`.
it_it: Per eliminarlo, si chiama :cpp:expr:`lv_monkey_delete(monkey)`.

source: To delete the character to the left of the current cursor position, use :cpp:expr:`lv_textarea_delete_char(textarea)`.
it_it: Per eliminare il carattere a sinistra della posizione corrente del cursore, utilizzare :cpp:expr:`lv_textarea_delete_char(textarea)`.

source: To delete to the right, use :cpp:expr:`lv_textarea_delete_char_forward(textarea)`
it_it: Per eliminare a destra, utilizzare :cpp:expr:`lv_textarea_delete_char_forward(textarea)`

source: To describe a transition an :cpp:struct:`lv_style_transition_dsc_t` variable needs to be initialized and added to a style:
it_it: Per descrivere una transizione, è necessario inizializzare una variabile :cpp:struct:`lv_style_transition_dsc_t` e aggiungerla a uno stile:

source: To describe opacity the :cpp:type:`lv_opa_t` type is created from ``uint8_t``.
it_it: Per descrivere l'opacità, il tipo :cpp:type:`lv_opa_t` viene creato da ``uint8_t``.

source: To destroy the *imgfont* that is no longer used, use :cpp:expr:`lv_imgfont_destroy(imgfont)`.
it_it: Per eliminare *imgfont* che non viene più utilizzato, si usa :cpp:expr:`lv_imgfont_destroy(imgfont)`.

source: To determine which state's property to use let's take an example.
it_it: Per determinare quale proprietà dello stato utilizzare, prendiamo un esempio.

source: To display the measured value on a label, 3 things are required:
it_it: Per visualizzare il valore misurato su un'etichetta, sono necessari 3 elementi:

source: To do so, follow the instructions in :ref:`file_system`.
it_it: Per farlo, seguire le istruzioni in :ref:`file_system`.

source: To do so, simply add this to your project's ``CMakeLists.txt``.
it_it: Per farlo, è sufficiente aggiungerlo al file ``CMakeLists.txt`` del progetto.

source: To do so, use :cpp:expr:`lv_label_set_text_static(label, "Text")`.
it_it: Per farlo, si usa :cpp:expr:`lv_label_set_text_static(label, "Text")`.

source: To do this call :cpp:expr:`lv_obj_set_grid_cell(child, column_align, column_pos, column_span, row_align, row_pos, row_span)`.
it_it: Per farlo, si chiama :cpp:expr:`lv_obj_set_grid_cell(child, column_align, column_pos, column_span, row_align, row_pos, row_span)`.

source: To do this click the "Fork" button in the top right corner.
it_it: Per farlo, cliccare sul pulsante "Fork" nell'angolo in alto a destra.

source: To do this use :cpp:expr:`lv_arc_align_obj_to_angle(arc, widget_to_align, radius_offset)`.
it_it: Per fare ciò, si usa :cpp:expr:`lv_arc_align_obj_to_angle(arc, widget_to_align, radius_offset)`.

source: To do this, clone LVGL to your project with the following command:
it_it: Per farlo, clonare LVGL nel proprio progetto con il seguente comando:

source: To do this, pass a non-zero value to this function to set the duration for the reverse portion of the Animation: :cpp:expr:`lv_anim_set_reverse_duration(&anim_template, duration_in_ms)`.
it_it: Per fare ciò, si passa un valore diverso da zero a questa funzione per impostare la durata della parte inversa dell'Animazione: :cpp:expr:`lv_anim_set_reverse_duration(&anim_template, duration_in_ms)`.

source: To do this, use :cpp:expr:`lv_image_cache_drop(&my_png)`.
it_it: Per farlo, si usa :cpp:expr:`lv_image_cache_drop(&my_png)`.

source: To draw something to the Canvas use LVGL's draw functions directly.
it_it: Per disegnare qualcosa sul Canvas, utilizzare direttamente le funzioni di disegno di LVGL.

source: To drive the timers of LVGL you need to call :cpp:func:`lv_timer_handler` periodically in one of the following:
it_it: Per gestire i timer di LVGL è necessario chiamare periodicamente :cpp:func:`lv_timer_handler` in uno dei seguenti modi:

source: To emulate elapsed time, two functions can be used:
it_it: Per emulare il tempo trascorso, è possibile utilizzare due funzioni:

source: To enable OS features in LVGL on NuttX, set :c:macro:`LV_USE_OS` to :c:macro:`LV_OS_PTHREAD`.
it_it: Per abilitare le funzionalità del sistema operativo in LVGL su NuttX, impostare :c:macro:`LV_USE_OS` a :c:macro:`LV_OS_PTHREAD`.

source: To enable it, set ``LV_COLOR_DEPTH 1`` or use :cpp:expr:`lv_display_set_color_format(display, LV_COLOR_FORMAT_I1)`.
it_it: Per abilitarlo, impostare ``LV_COLOR_DEPTH 1`` o utilizzare :cpp:expr:`lv_display_set_color_format(display, LV_COLOR_FORMAT_I1)`.

source: To enable its multi-instance feature, set :c:macro:`LV_GLOBAL_CUSTOM` in ``lv_conf.h`` and provide a custom function to :cpp:func:`lv_global_default` using ``__thread`` or ``pthread_key_t``.
it_it: Per abilitare la funzionalità multi-istanza, impostare :c:macro:`LV_GLOBAL_CUSTOM` in ``lv_conf.h`` e fornire una funzione personalizzata a :cpp:func:`lv_global_default` utilizzando ``__thread`` o ``pthread_key_t``.

source: To enable key pop-overs on press, like on common Android and iOS keyboards, use :cpp:expr:`lv_keyboard_set_popovers(kb, true)`.
it_it: Per abilitare i pop-over dei tasti alla pressione, come sulle comuni tastiere Android e iOS, si usa :cpp:expr:`lv_keyboard_set_popovers(kb, true)`.

source: To enable logging, set :c:macro:`LV_USE_LOG` in ``lv_conf.h`` to a non-zero value and set :c:macro:`LV_LOG_LEVEL` to one of the following values.
it_it: Per abilitare il logging, impostare :c:macro:`LV_USE_LOG` in ``lv_conf.h`` su un valore diverso da zero e impostare :c:macro:`LV_LOG_LEVEL` su uno dei seguenti valori.

source: To enable multi-touch gesture recognition, set the ``LV_USE_GESTURE_RECOGNITION`` option in the ``lv_conf.h`` file.
it_it: Per abilitare il riconoscimento dei gesti multi-touch, impostare l'opzione ``LV_USE_GESTURE_RECOGNITION`` nel file ``lv_conf.h``.

source: To enable such behavior on the display driver, the PPA acceleration should be set on the project `sdkconfig.defaults` via the symbol `CONFIG_LVGL_PORT_ENABLE_PPA`, setting it to true will make the hardware assistance for image rotation and mirroring automatic.
it_it: Per abilitare tale comportamento sul driver del display, l'accelerazione del PPA deve essere impostata nel progetto `sdkconfig.defaults` tramite il simbolo `CONFIG_LVGL_PORT_ENABLE_PPA`; impostandola su "true" l'assistenza hardware per la rotazione e il mirroring delle immagini verrà automatizzata.

source: To enable synchronization, add a ``project_local.xml`` file with the following content:
it_it: Per abilitare la sincronizzazione, si aggiunge un file ``project_local.xml`` col seguente contenuto:

source: To enable the PSRAM usage the user should:
it_it: Per abilitare l'utilizzo della PSRAM, l'utente deve:

source: To enable the demos and examples set these options:
it_it: Per abilitare le demo e gli esempi, impostare queste opzioni:

source: To enable the profiler, set :c:macro:`LV_USE_PROFILER` in ``lv_conf.h`` and configure the following options:
it_it: Per abilitare il profiler, si imposta :c:macro:`LV_USE_PROFILER` in ``lv_conf.h`` e si configurano le seguenti opzioni:

source: To enable this feature you have to edit the ``lv_conf.h`` file and enable logging in the section ``log settings``:
it_it: Per abilitare questa funzionalità, è necessario modificare il file ``lv_conf.h`` e abilitare il logging nella sezione ``log settings``:

source: To enable this feature, set ``LV_LABEL_LONG_TXT_HINT`` to ``1`` in ``lv_conf.h``.
it_it: Per abilitare questa funzionalità, impostare ``LV_LABEL_LONG_TXT_HINT`` a ``1`` in ``lv_conf.h``.

source: To enable this feature, you can simply call :cpp:expr:`lv_evdev_discovery_start(NULL, NULL)`.
it_it: Per abilitare questa funzionalità, è sufficiente chiamare :cpp:expr:`lv_evdev_discovery_start(NULL, NULL)`.

source: To enable this, set the following options in your ``lv_conf.h`` (or via Kconfig/CMake):
it_it: Per abilitare questa funzionalità, si impostano le seguenti opzioni in ``lv_conf.h`` (o tramite Kconfig/CMake):

source: To enabling it the user should set on its `sdkconfig.defaults` the `CONFIG_BSP_DISPLAY_LVGL_AVOID_TEAR`, which will tell the driver to use the DMA2D to optimize transfer.
it_it: Per abilitarla, l'utente deve impostare `CONFIG_BSP_DISPLAY_LVGL_AVOID_TEAR` nel file `sdkconfig.defaults`, che indicherà al driver di utilizzare DMA2D per ottimizzare il trasferimento.

source: To ensure all licensing criteria are met for every repository of the LVGL project, we apply a process called DCO (Developer's Certificate of Origin).
it_it: Per garantire che tutti i criteri di licenza siano soddisfatti per ogni repository del progetto LVGL, applichiamo un processo chiamato DCO (Developer's Certificate of Origin [Certificato di Origine dello Sviluppatore]).

source: To ensure correct compilation, you need to instruct the Arduino build system to define ``LV_LVGL_H_INCLUDE_SIMPLE`` during compilation.
it_it: Per garantire una compilazione corretta, è necessario indicare al sistema di build di Arduino di definire ``LV_LVGL_H_INCLUDE_SIMPLE`` durante la compilazione.

source: To ensure that the redrawn areas start and end on byte boundaries, you can add a rounder callback to your display driver.
it_it: Per garantire che le aree ridisegnate inizino e finiscano sui limiti dei byte, è possibile aggiungere una callback di tipo "rounder" al driver video.

source: To ensure the layers were added as expected, run the Bitbake command to show all the layers::
it_it: Per assicurarsi che i layer siano stati aggiunti come previsto, eseguire il comando Bitbake per visualizzarli tutti:

source: To execute the registered test, use :cpp:expr:`lv_xml_test_run_all(slowdown)`.
it_it: Per eseguire il test registrato, si usa :cpp:expr:`lv_xml_test_run_all(slowdown)`.

source: To explicitly set number of rows and columns use :cpp:expr:`lv_table_set_row_count(table, row_cnt)` and :cpp:expr:`lv_table_set_column_count(table, col_cnt)`.
it_it: Per impostare esplicitamente il numero di righe e colonne, si usano :cpp:expr:`lv_table_set_row_count(table, row_cnt)` e :cpp:expr:`lv_table_set_column_count(table, col_cnt)`.

source: To facilitate debugging LVGL with GDB, a GDB plugin is provided.
it_it: Per facilitare il debug di LVGL con GDB, è disponibile un plugin GDB.

source: To find a widget use ``obj_name``.
it_it: Per trovare un widget, utilizzare ``obj_name``.

source: To find out whether the Checkbox is checked use :cpp:expr:`lv_obj_has_state(cb, LV_STATE_CHECKED)`.
it_it: Per scoprire se la Checkbox è selezionata, si usa :cpp:expr:`lv_obj_has_state(cb, LV_STATE_CHECKED)`.

source: To find out which widget in a group has focus, if any, call :cpp:expr:`lv_group_get_focused(group)`.
it_it: Per scoprire quale widget in un gruppo ha il focus, se ce n'è uno, si chiama :cpp:expr:`lv_group_get_focused(group)`.

source: To find the location of a specific config, Press the "/" key to open a search interface.
it_it: Per trovare la posizione di una configurazione specifica, premere il tasto "/" per aprire un'interfaccia di ricerca.

source: To find the right key map values, you may use the ``setxkbmap -query`` command.
it_it: Per trovare i valori corretti per la mappatura dei tasti, è possibile utilizzare il comando ``setxkbmap -query``.

source: To fix that behavior just add to the `sdkconfig.defaults` the following option:
it_it: Per correggere questo comportamento, è sufficiente aggiungere a `sdkconfig.defaults` la seguente opzione:

source: To follow this guide you obviously need to have a Toradex SoM along with a carrier board.
it_it: Per seguire questa guida è ovviamente necessario disporre di un SoM Toradex e di una board carrier.

source: To force PlatformIO to compile and run them, add the following to your ``platformio.ini``:
it_it: Per forzare PlatformIO a compilarli ed eseguirli, aggiungere quanto segue al proprio file ``platformio.ini``:

source: To generate a font with a specific stride (such as 1), you should use the `offline font converter <https://github.com/lvgl/lv_font_conv>`__ and specify a stride argument on the command line, e.g. ``--stride 1``.
it_it: Per generare un font con uno stride specifico (ad esempio 1), è necessario utilizzare `offline font converter <https://github.com/lvgl/lv_font_conv>`__ e specificare un argomento stride sulla riga di comando, ad esempio ``--stride 1``.

source: To generate a pixel array from a PNG, JPG or BMP image, use the `LVGL Online Image Converter`_ and set the converted image as the image source with its pointer with :cpp:expr:`lv_image_set_src(img1, &converted_img_var)`.
it_it: Per generare una matrice di pixel da un'immagine PNG, JPG o BMP, si usa `LVGL Online Image Converter`_ e si imposta l'immagine convertita come sorgente dell'immagine con il suo puntatore con :cpp:expr:`lv_image_set_src(img1, &converted_img_var)`.

source: To generate an SDK of the environment, run the following command:
it_it: Per generare un SDK dell'ambiente, eseguire il seguente comando:

source: To get a pointer to the "Active Screen", call :cpp:func:`lv_screen_active`.
it_it: Per ottenere un puntatore allo "Screen Attivo", si chiama :cpp:func:`lv_screen_active`.

source: To get a property's value from a style:
it_it: Per ottenere il valore di una proprietà da uno stile:

source: To get familiar with observers, subjects, and data bindings in general visit the :ref:`Observer <observer_how_to_use>` page.
it_it: Per familiarizzare con "observer", "subject" e data binding in generale, visitare la pagina :ref:`Observer <observer_how_to_use>`.

source: To get familiar with observers, subjects, and data bindings in general, visit the :ref:`Observer <observer_how_to_use>` page.
it_it: Per familiarizzare con "observer", "subject" e data binding in generale, visitare la pagina :ref:`Observer <observer_how_to_use>`.

source: To get points to be drawn on the chart, you must set their Y-values to something other than :c:macro:`LV_CHART_POINT_NONE`.
it_it: Per far sì che i punti vengano disegnati sul grafico, è necessario impostare i loro valori Y su un valore diverso da :c:macro:`LV_CHART_POINT_NONE`.
